emacs-config.org
#+TITLE: Emacs Main Configuration File
#+AUTHOR: Mingkai Dong
#+DATE: 2021-02-16T01:16:18+0800
#+EMAIL: mk@dong.mk
#+PROPERTY: header-args :tangle emacs-config.el


* Options
#+BEGIN_SRC emacs-lisp
  ;;; emacs-config.el --- Main Emacs Configuration  -*- lexical-binding: t -*-
  ;;; Commentary:

  ;;; Code:

  (defvar mk-feature/bibliography t "Enable bibliography.")
  (defvar mk-feature/gui t "Enable GUI-related packages.")
  (defvar mk-feature/noteman t "Enable note management.")
  (defvar mk-feature/light t "Use light mode.")
  (defvar mk-feature/news-mail t "Enable news and mails.")
  (when is-android
    (setq mk-feature/bibliography nil
          mk-feature/gui nil
          mk-feature/news-mail nil
          mk-feature/noteman nil))
#+END_SRC
* early-init.el
:PROPERTIES:
:HEADER-ARGS: :tangle early-init.el
:END:

#+BEGIN_SRC emacs-lisp
  ;;; early-init.el --- Early Emacs configuration  -*- lexical-binding: t -*-
  ;;; Commentary:

  ;;; Code:

  (defvar is-android (string= system-type "android") "Whether on Anroid.")

  ;; (setq debug-on-error t)
  ;; (setq debug-on-signal t)
  (setq-default
   ;; Package
   load-prefer-newer t ; Load newer packages when available.
   package-enable-at-startup nil  ; do not load packege.el
   package-quickstart nil
   package-native-compile nil
   ;; GC
   gc-cons-threshold most-positive-fixnum
   gc-cons-percentage 0.6
   ;; Resizing the Emacs frame can be a terribly expensive part of changing the
   ;; font. By inhibiting this, we easily halve startup times with fonts that are
   ;; larger than the system default.
   frame-inhibit-implied-resize t
   )

  (fset 'yes-or-no-p 'y-or-n-p)
  (setq confirm-kill-emacs 'y-or-n-p)
  (setq comp-deferred-compilation nil)


  (setenv "LIBRARY_PATH"
          (format "%s:%s"
                  (string-join
                   '("/opt/homebrew/opt/gcc/lib/gcc/current"
                     "/opt/homebrew/opt/libgccjit/lib/gcc/current"
                     "/opt/homebrew/opt/gcc/lib/gcc/current/gcc/aarch64-apple-darwin24/14/"
                     ) ":")
                  (or (getenv "LD_LIBRARY_PATH") "")))
  (when is-android
    (setenv "PATH" (format "%s:%s" "/data/data/com.termux/files/usr/bin"
                           (getenv "PATH")))
    (setenv "LD_LIBRARY_PATH" (format "%s:%s"
                                      "/data/data/com.termux/files/usr/lib"
                                      (getenv "LD_LIBRARY_PATH")))
    (push "/data/data/com.termux/files/usr/bin" exec-path)
    )
  (when (string-equal system-type "android")
    ;; Add Termux binaries to PATH environment
    (let ((termuxpath "/data/data/com.termux/files/usr/bin"))
      (setenv "PATH" (concat (getenv "PATH") ":" termuxpath))
      (setq exec-path (append exec-path (list termuxpath)))))

  (unless is-android
    (when (display-graphic-p)
      (tool-bar-mode -1) ; t for enable, nil for disable, -1 for toggle
      (scroll-bar-mode -1)
      (menu-bar-mode -1))

    (setq source-directory (expand-file-name "~/Library/Caches/Homebrew/emacs-plus@31--git"))

    (setq-default
     default-frame-alist
     `(
       (left-fringe . 8)                    ;; Thin left fringe
       (menu-bar-lines . 0)                 ; No menu bar
       (right-divider-width . 1)            ;; Thin vertical window divider
       (right-fringe . 3)                   ;; Thin right fringe
       (tool-bar-lines . 0)                 ; No tool bar
       (tab-bar-lines . 0)                  ; No tab bar
       ;; (undecorated . 1)                 ; this will completely remove the titlebar
       (ns-titlebar-height-adjust . -10)    ; this is actually not used
       (ns-title-hidden . 1)                ; hide the title text in the titlebar
       (ns-fullsize-content . 1)            ; make the content full size
       (ns-transparent-titlebar . 1)        ; make the titlebar transparent
       (vertical-scroll-bars . nil)         ; No vertical scroll-bars
       (horizontal-scroll-bars . nil)       ; No horizontal scroll-bars
       (undecorated . t)
       (width . 120)
       (height . 50)
       (font . "Monaco-12")
       (minibuffer . t)
       (drag-with-header-line . t)
       (drag-with-mode-line . t)
       (drag-with-internal-border . t)
       ))
    ;; (set-frame-font "Monaco-12" nil t)
    (set-face-attribute 'fixed-pitch nil :family "Monaco")

    ) ; End of unless is-android

  ;; (when window-system (set-frame-size (selected-frame) 120 50))

  ;; UTF-8
  (prefer-coding-system 'utf-8)
  (when (display-graphic-p)
    (setq x-select-request-type '(UTF8_STRING COMPUND_TEXT TEXT STRING)))
  ;; Unicode
  (set-language-environment "UTF-8")
  (set-default-coding-systems 'utf-8)

  (setq locale-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)

  (setq current-language-environment "UTF-8")
  ;; (setq default-input-method "rfc1345")

  ;; Sentence
  (setq sentence-end-double-space nil) ; Use only one space to end a sentence

  (provide 'early-init)
  ;;; early-init.el ends here
#+END_SRC

* init.el
:PROPERTIES:
:HEADER-ARGS: :tangle init.el
:END:

#+BEGIN_SRC emacs-lisp
  ;;; init.el --- -*- lexical-binding: t -*-
  ;;; Commentary:

  ;;; Code:


  (setq gc-cons-threshold (* 4 (expt 2 20))
        gc-cons-percentage 0.6)

  (let* (;; (file-name-handler-alist nil)  ; This causes loading issues. Check: https://lists.gnu.org/archive/html/emacs-devel/2022-08/msg00218.html
         (read-process-output-max (expt 2 22)))

    ;; 将lisp目录放到加载路径的前面以加快启动速度
    (let ((dir (locate-user-emacs-file "init-lisp")))
      (add-to-list 'load-path (file-name-as-directory dir)))
    (let ((dir (locate-user-emacs-file "lisp")))
      (add-to-list 'load-path (file-name-as-directory dir)))

    (load "~/.emacs.d/emacs-config.el")

    ;; Collect garbage when all else is done
    ;; (garbage-collect)
    )

  (setq gc-cons-threshold (expt 2 23)
        gc-cons-percentage 0.1)
  (setq gc-cons-threshold (expt 2 28)
        gc-cons-percentage 0.3)

  (message "Everything is up. Wish you a nice day. :)")
  (put 'narrow-to-region 'disabled nil)

  (provide 'init)
  ;;; init.el ends here
#+END_SRC

* Base and Core :emacs:
** Literal Configuration Bootstrap
#+BEGIN_SRC emacs-lisp
  (defvar mkconfig/.org "~/.emacs.d/emacs-config.org")
  (defvar mkconfig/.el (concat (file-name-sans-extension mkconfig/.org) ".el"))
  (defun mk/sync-emacs-config()
    "Synchronize config from org to el and compile to elc."
    (interactive)
    ;; Avoid running hooks when tangling. From https://delta.re/emacs-config-org/
    (let ((prog-mode-hook nil))
      (require 'ob-tangle)
      ;; Tangle the file. It's fast.
      (org-babel-tangle-file mkconfig/.org)
      (message "[CONFIG] Config is synchronized.")
      ;; Async compile the config.
      (async-byte-compile-file mkconfig/.el)))

  ;; Sync config when the config file is saved.
  (add-hook 'after-save-hook
            (lambda ()
              (if (equal (buffer-file-name) (expand-file-name mkconfig/.org))
                  (mk/sync-emacs-config))))
#+END_SRC

** Bootstrap

*** Custom Files

#+BEGIN_SRC emacs-lisp
  (setq custom-file "~/.emacs.d/customs.el")
  (add-hook 'elpaca-after-init-hook (lambda () (load custom-file 'noerror)))
#+END_SRC

*** Packages

**** elpaca replacing straight.el replacing package.el

| elpaca             | https://github.com/progfolio/elpaca          |
| straight.el        | https://github.com/raxod502/straight.el      |
| package.el         | built-in package system                      |
| quelpa             | https://github.com/quelpa/quelpa             |
| quelpa-use-package | https://github.com/quelpa/quelpa-use-package |
| paradox            | A modern interface for package.el            |

#+BEGIN_SRC emacs-lisp
  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))


#+END_SRC

**** use-package: A use-package declaration for simplifying your .emacs

| use-package | https://github.com/jwiegley/use-package |
| diminish |                                              |
| [[https://elpa.gnu.org/packages/delight.html][delight]]  | better: altering mode appearance on modeline |

#+BEGIN_SRC emacs-lisp
  ;; Install use-package support
  (elpaca-wait)
  (setq use-package-always-ensure t)
  (elpaca bind-key) ; elpaca-use-package will trigger bind-key, so we have to specify it before
  (elpaca elpaca-use-package
          ;; Enable use-package :ensure support for Elpaca.
          (elpaca-use-package-mode))
  (elpaca-wait)
#+END_SRC



** Benchmarks

#+BEGIN_SRC emacs-lisp
  (use-package benchmark-init
    :ensure t
    :config
    ;; To disable collection of benchmark data after init is done.
    (add-hook 'elpaca-after-init-hook 'benchmark-init/deactivate))

  ;; (use-package bind-key :ensure (:wait t))
  (use-package compat :ensure (:wait t))
  (use-package use-package-ensure-system-package :ensure nil)
  (use-package delight :ensure (:wait t))
#+END_SRC

** Emacs Server

#+BEGIN_SRC emacs-lisp
  (unless is-android
    ;;; The server part may not be configured so early.
    (load "server") ; Load and start server if it's not running
    (unless (server-running-p) (server-start))
    )
#+END_SRC

** The PATH

#+BEGIN_SRC emacs-lisp
  ;;; Get shell env from user shell.
  ;; https://apple.stackexchange.com/questions/51677/how-to-set-path-for-finder-launched-applications
  ;; $ sudo launchctl config user path /usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin
  ;; We need to at least make the /usr/local/bin in the path so that imagemagick can use rsgv rather than its built-in svg renderer.
  ;; The above command works.
  (use-package exec-path-from-shell
    :init
    (exec-path-from-shell-initialize))
#+END_SRC



** SETQs

#+BEGIN_SRC emacs-lisp
  (setq
   ;; Backups
   backup-by-copying t
   backup-directory-alist '(("." . "~/.emacs.d/backups"))
   delete-old-versions t
   kept-new-versions 6
   kept-old-versions 2
   version-control t
   vc-make-backup-files t
   ;;(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
   ;;(setq delete-old-versiojns -1)
   ;;(setq version-control t)
   auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t))
   ;; History
   savehist-file "~/.emacs.d/savehist"
   history-length t
   history-delete-duplicates t
   savehist-save-minibuffer-history 1
   savehist-additional-variables '(kill-ring search-ring regex-search-ring))
  (savehist-mode 1)
  (setq-default
   ;; From: https://stackoverflow.com/questions/4657142/how-do-i-encourage-emacs-to-follow-the-compilation-buffer
   compilation-scroll-output t
   ;; (setq compilation-scroll-output 'first-error)
   ;; Prevent Extraneous Tabs
   indent-tabs-mode nil
   fill-column 100
   ;; line-spacing 0.1
   )
  (setq enable-recursive-minibuffers t)
  (minibuffer-depth-indicate-mode 1)
  (defun mkvoya/better-wrap ()
    "Make the word wrap better."
    (interactive)
    (progn
      (visual-line-mode t)
      ;; (setq word-wrap nil)
      ))

  (blink-cursor-mode 1)

  (setq delete-by-moving-to-trash t)
#+END_SRC

#+begin_src emacs-lisp
  (use-package ns-win
    :if (memq window-system '(mac ns))
    :ensure nil
    :init
    ;; (setq mac-right-command-modifier 'control)
    ;; (setq mac-right-option-modifier 'control)
    )
#+end_src

